In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  10   5   4  13  14
1  13  15  13   1  13
2  14   6   5   5  10
3   5   6   6   6  15
4   5  12  13  19  14

In [3]:
df.query('A > 10')

    A   B   C  D   E
1  13  15  13  1  13
2  14   6   5  5  10

In [4]:
rerata = df['A'].mean()
rerata

np.float64(9.4)

In [5]:
df.query('A > @rerata')

    A   B   C   D   E
0  10   5   4  13  14
1  13  15  13   1  13
2  14   6   5   5  10